hackathon/src/InformationRegisters/ОбращенияТГ/ОбращенияТГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбращенияТГ</name>
  <dimensions>
    <name>Запись</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/Enums/МоделиИИ/МоделиИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МоделиИИ</name>
  <enumValues>
    <name>RuBert</name>
  </enumValues>
  <enumValues>
    <name>Gemini</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/Enums/ТипыОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТехническаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВопросПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Жалоба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/СтатусыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/ПриоритетыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПриоритетыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Срочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Enums/ТональностьОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТональностьОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Позитивная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нейтральная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Негативная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/Catalogs/Обращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Обращения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТональностьОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешний</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

hackathon/src/CommonModules/ОбращенияТГ/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Токен доступа бота - Строка
Функция ПолучитьСообщения() Экспорт

	ТокенДоступаБота = "8208081640:AAEM-yihcdF685N8OEF9YYg5-7L6iBhPT5w";
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки   = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	Запрос = Новый HTTPЗапрос("bot" + ТокенДоступаБота + "/getUpdates", Заголовки);
	Ответ = Соединение.Получить(Запрос);
	ОтветСтрока = ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON	= Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСтрока);	
	Данные = ПрочитатьJSON(ЧтениеJSON);
		
	ЧтениеJSON.Закрыть();
	
	Если Данные.ok Тогда
		
		ПолученныеСообщения = Новый Соответствие;
		
		Для Каждого Сообщение из Данные.result Цикл
			
			ПолученныеСообщения.Вставить(СтрЗаменить(Строка(Сообщение.update_id)," ",""), Сообщение.message);
		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОбращенияТГ.Запись КАК Запись
			|ИЗ
			|	РегистрСведений.ОбращенияТГ КАК ОбращенияТГ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПолученныеСообщения.Удалить(Выборка.Запись); //закомментить для теста
			
		КонецЦикла;
		
		
		Для Каждого НовоеСообщение из ПолученныеСообщения Цикл
			
			Запись = РегистрыСведений.ОбращенияТГ.СоздатьМенеджерЗаписи();
	    	Запись.Запись = НовоеСообщение.Ключ;
	    	Запись.Записать(Истина);
			
			ОтправитьЗапрос(НовоеСообщение.Значение.text, НовоеСообщение.Значение.chat.id);
		
		КонецЦикла;
		
		
	КонецЕсли;

КонецФункции

Процедура ОтправитьЗапрос(ТекстЗапроса, ЧатИД)
    
    // Проверяем на клиенте, что текст заполнен
    Если ПустаяСтрока(ТекстЗапроса) Тогда
        Сообщить("Введите текст обращения");
        Возврат;
    КонецЕсли;
    
    МодельИИ = Перечисления.МоделиИИ.RuBert;

	Если МодельИИ = ПредопределенноеЗначение("Перечисление.МоделиИИ.RuBert") Тогда 
    	// Вызываем серверную процедуру
    	Результат = ОтправитьЗапросИСоздатьОбращениеНаСервере(ТекстЗапроса, ЧатИД);
	Иначе
		ОтветЗапроса = ПолучитьСообщениеGemini(ТекстЗапроса);
		Результат = Истина;
	КонецЕсли;
    
    Если Результат Тогда
        Сообщить("Обращение успешно создано!");
        ТекстЗапроса = ""; // Очищаем поле
    Иначе
        Сообщить("Не удалось создать обращение");
    КонецЕсли;
    
КонецПроцедуры

Функция ОтправитьЗапросИСоздатьОбращениеНаСервере(ТекстЗапроса, ЧатИД)
    
    // Отправляем запрос к ML-серверу
    ОтветСервера = ОтправитьЗапросКСерверу(ТекстЗапроса);
    Если ОтветСервера = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    // Создаем обращение в базе данных
    Результат = СоздатьОбращениеВБазе(ТекстЗапроса, ОтветСервера, ЧатИД);
    
    Возврат Результат;
    
КонецФункции

Функция ОтправитьЗапросКСерверу(ТекстЗапроса)
    
    Попытка
        HTTPСоединение = Новый HTTPСоединение("localhost", 8000);
        Заголовки = Новый Соответствие;
        Заголовки.Вставить("Content-Type", "application/json");
        HTTPЗапрос = Новый HTTPЗапрос("/classify",Заголовки);
        ОтправляемаяСтруктура = Новый Структура;
        ОтправляемаяСтруктура.Вставить("text", ТекстЗапроса);
        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, ОтправляемаяСтруктура);
        ОтправляемаяСтрока = ЗаписьJSON.Закрыть();
        HTTPЗапрос.УстановитьТелоИзСтроки(ОтправляемаяСтрока);
        Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
        ОтветЗапроса = Ответ.ПолучитьТелоКакСтроку();
        
        Возврат ОтветЗапроса;
        
    Исключение
        Сообщить("Ошибка при отправке запроса к серверу: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

Функция СоздатьОбращениеВБазе(ТекстЗапроса, ОтветСервера, ЧатИД)
    
    Попытка
        // Разбор JSON ответа
        Данные = РазобратьJSONПравильно(ОтветСервера);
        Если Данные = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;

        // Создаем новое обращение
        НовоеОбращение = Справочники.Обращения.СоздатьЭлемент();

        // Заполняем основные поля
        НовоеОбращение.ЧатИД = ЧатИД;
        НовоеОбращение.ТекстОбращения = ТекстЗапроса;
        
        // Заполняем тип (category)
        Категория = НРег(СокрЛП(Данные.category));
        Если Категория = "жалоба" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.Жалоба;
        ИначеЕсли Категория = "техническая ошибка" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.ТехническаяОшибка;
        ИначеЕсли Категория = "вопрос по оплате" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.ВопросПоОплате;
        ИначеЕсли Категория = "предложение" Тогда
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.Предложение;
        Иначе
            НовоеОбращение.Тип = Перечисления.ТипыОбращений.Прочее;
        КонецЕсли;
        
        // Заполняем статус
        НовоеОбращение.Статус = Перечисления.СтатусыОбращения.ВРаботе;
        
        // Заполняем приоритет (priority)
        Приоритет = НРег(СокрЛП(Данные.priority));
        Если Приоритет = "высокий" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Высокий;
        ИначеЕсли Приоритет = "срочный" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Срочный;
        ИначеЕсли Приоритет = "средний" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Средний;
        ИначеЕсли Приоритет = "низкий" Тогда
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Низкий;
        Иначе
            НовоеОбращение.Приоритет = Перечисления.ПриоритетыОбращения.Средний;
        КонецЕсли;
        
        // Заполняем тональность (tone)
        Тон = НРег(СокрЛП(Данные.tone));
        Если Тон = "нейтральная" Тогда
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Нейтральная;
        ИначеЕсли Тон = "позитивная" Тогда
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Позитивная;
        ИначеЕсли Тон = "негативная" Тогда
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Негативная;
        Иначе
            НовоеОбращение.Тональность = Перечисления.ТональностьОбращений.Нейтральная;
        КонецЕсли;
        
        // Заполняем системные поля (исправлено - убрана Дата)
        НовоеОбращение.Автор = ПользователиИнформационнойБазы.ТекущийПользователь();
        НовоеОбращение.Источник = "Обработка";
        // Дата = ТекущаяДата(); // Убрали если нет такого поля
        
        // Создаем наименование
        КороткийТекст = ТекстЗапроса;
        Если СтрДлина(КороткийТекст) > 30 Тогда
            КороткийТекст = Лев(КороткийТекст, 30) + "...";
        КонецЕсли;
        НовоеОбращение.Наименование = Данные.category + " - " + КороткийТекст;
        
        // Сохраняем
        НовоеОбращение.Записать();
        
        Сообщить("Обращение успешно создано!");
        Возврат Истина;
        
    Исключение
        Сообщить("Ошибка при создании обращения: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
    
КонецФункции

Функция РазобратьJSONПравильно(JSONСтрока)
    
    Попытка
        Сообщить("Получен ответ от сервера: " + JSONСтрока);
        
        // РУЧНОЙ РАЗБОР JSON через строковые функции
        Данные = Новый Структура;
        
        // Убираем фигурные скобки и пробелы
        JSONСтрока = СокрЛП(СтрЗаменить(JSONСтрока, "{", ""));
        JSONСтрока = СокрЛП(СтрЗаменить(JSONСтрока, "}", ""));
        
        // Разбиваем по запятым на отдельные пары "ключ:значение"
        Пары = СтрРазделить(JSONСтрока, ",");
        
        Для Каждого Пара Из Пары Цикл
            Пара = СокрЛП(Пара);
            Если Найти(Пара, ":") > 0 Тогда
                // Разбиваем на ключ и значение
                КлючИЗначение = СтрРазделить(Пара, ":");
                Если КлючИЗначение.Количество() >= 2 Тогда
                    Ключ = СокрЛП(СтрЗаменить(КлючИЗначение[0], """", ""));
                    Значение = СокрЛП(СтрЗаменить(КлючИЗначение[1], """", ""));
                    Данные.Вставить(Ключ, Значение);
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
        
        // Выводим что получили
        Сообщить("Успешно разобрано полей: " + Данные.Количество());
        Для Каждого Элемент Из Данные Цикл
            Сообщить(Элемент.Ключ + " = " + Элемент.Значение);
        КонецЦикла;
        
        Возврат Данные;
        
    Исключение
        Сообщить("Ошибка при разборе JSON: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

Функция ПолучитьСообщениеGemini(ТекстЗапроса)
	
	Возврат Интеграции.ПолучитьСообщениеGemini(ТекстЗапроса);

КонецФункции

#КонецОбласти
